; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_2 type_3)
 (:predicates (pred_4 ?v8 - type_2 ?v1 - type_1)
 	      (pred_2 ?v6 - object ?v1 - type_1)
	      (pred_1 ?v8 - type_2 ?v3 - type_3)
	      (pred_3 ?v8 - type_2 ?v6 - object ?v3 - type_3))

   (:action op_3
       :parameters  (?v8 - type_2 ?v4 ?v2 - type_1)
       :precondition (and  (pred_4 ?v8 ?v4))
       :effect (and  (pred_4 ?v8 ?v2)
		     (not (pred_4 ?v8 ?v4))))

   (:action op_2
       :parameters (?v8 - type_2 ?v7 - object ?v5 - type_1 ?v3 - type_3)
       :precondition  (and  (pred_2 ?v7 ?v5) (pred_4 ?v8 ?v5) (pred_1 ?v8 ?v3))
       :effect (and (pred_3 ?v8 ?v7 ?v3)
		    (not (pred_2 ?v7 ?v5)) 
		    (not (pred_1 ?v8 ?v3))))

   (:action op_1
       :parameters (?v8 - type_2 ?v7 - object ?v5 - type_1 ?v3 - type_3)
       :precondition  (and  (pred_3 ?v8 ?v7 ?v3) (pred_4 ?v8 ?v5))
       :effect (and (pred_2 ?v7 ?v5)
		    (pred_1 ?v8 ?v3)
		    (not (pred_3 ?v8 ?v7 ?v3)))))

; problem
(define (problem gripper-1-3-3)
(:domain gripper-strips)
(:objects obj_04 - type_2
obj_05 obj_02 - type_3
obj_08 obj_07 obj_03 - type_1
obj_06 obj_01 obj_09 - object)
(:init
(pred_4 obj_04 obj_03)
(pred_1 obj_04 obj_05)
(pred_1 obj_04 obj_02)
(pred_2 obj_06 obj_07)
(pred_2 obj_01 obj_08)
(pred_2 obj_09 obj_08)
)
(:goal
(and
(pred_2 obj_06 obj_03)
(pred_2 obj_01 obj_08)
(pred_2 obj_09 obj_03)
)
)

(:constraints
  (always (forall (?b - object)
           (not (pred_3 obj_04 ?b obj_05))))
)
)

; plan
1. (op_3 obj_04 obj_03 obj_07)
   deleted: (pred_4 obj_04 obj_03)
   added: (pred_4 obj_04 obj_07)
   goals met: 1 of 3
2. (op_2 obj_04 obj_06 obj_07 obj_02)
   deleted: (pred_2 obj_06 obj_07) (pred_1 obj_04 obj_02)
   added: (pred_3 obj_04 obj_06 obj_02)
   goals met: 1 of 3
3. (op_3 obj_04 obj_07 obj_08)
   deleted: (pred_4 obj_04 obj_07)
   added: (pred_4 obj_04 obj_08)
   goals met: 1 of 3
4. (op_3 obj_04 obj_08 obj_03)
   deleted: (pred_4 obj_04 obj_08)
   added: (pred_4 obj_04 obj_03)
   goals met: 1 of 3
5. (op_1 obj_04 obj_06 obj_03 obj_02)
   deleted: (pred_3 obj_04 obj_06 obj_02)
   added: (pred_2 obj_06 obj_03) (pred_1 obj_04 obj_02)
   goals met: 2 of 3
6. (op_3 obj_04 obj_03 obj_08)
   deleted: (pred_4 obj_04 obj_03)
   added: (pred_4 obj_04 obj_08)
   goals met: 2 of 3
7. (op_2 obj_04 obj_09 obj_08 obj_02)
   deleted: (pred_2 obj_09 obj_08) (pred_1 obj_04 obj_02)
   added: (pred_3 obj_04 obj_09 obj_02)
   goals met: 2 of 3
8. (op_3 obj_04 obj_08 obj_03)
   deleted: (pred_4 obj_04 obj_08)
   added: (pred_4 obj_04 obj_03)
   goals met: 2 of 3
9. (op_1 obj_04 obj_09 obj_03 obj_02)
   deleted: (pred_3 obj_04 obj_09 obj_02)
   added: (pred_2 obj_09 obj_03) (pred_1 obj_04 obj_02)
   goals met: 3 of 3
